src/test/jmeter/results/summary_spike_test.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET Homepage,24113,2703,4,11382,2549.94,0.000%,195.04954,1063.44,53.14,5583.0
GET ChatBot,23631,872,1,5938,1652.05,0.000%,191.53799,651.30,28.24,3482.0
GET Mappa,23368,1072,1,5936,1806.51,0.000%,189.34029,913.97,27.55,4943.0
TOTAL,71112,1559,1,11382,2205.11,0.000%,575.17693,2625.66,108.83,4674.5