src/test/jmeter/results/summary_stress_test.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET Homepage,57098,839,1,7504,1640.81,0.000%,156.94283,826.07,22.07,5389.8
GET ChatBot,56684,40,0,4808,343.55,0.000%,157.71008,536.25,23.26,3481.9
GET Mappa,56598,69,0,5966,505.77,0.000%,157.75698,761.50,22.95,4942.9
TOTAL,170380,317,0,7504,1078.76,0.000%,468.31623,2106.78,67.68,4606.6