src/test/jmeter/results_post_filters/summary_spike_test_filtered.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET Homepage,18916,6608,6,17733,4239.53,0.000%,148.13887,807.68,40.36,5583.0
GET ChatBot,17948,3062,1,7132,2502.25,0.000%,141.40746,480.84,20.85,3482.0
GET Mappa,17436,2934,2,6952,2502.11,0.000%,137.55236,663.99,20.01,4943.0
TOTAL,54300,4256,1,17733,3647.04,0.000%,425.24532,1944.77,80.96,4683.0